{
  "home": {
    "whoAmI": [
      "Hey there! I'm Aidan, a systems administrator, web developer, and student from the United States. I primarily work with Node.js and Linux.",
      "I am most interested in backend development and have experience with Node.js, Express, and Tailwind CSS. Despite my best efforts, I am no designer",
      "When I'm not programming, I can be found re-flashing my phone with a new custom ROM and telling everyone I use Arch."
    ],
    "whatIDo": [
      "I am at my best when I am doing system administration, but I also enjoy working on web development projects. I enjoy contributing under open licenses more than anything. I have never felt much of a draw to profiting off my work.",
      "I host a few public services and websites on my VPS, most of which can be found on the \"Domains\" page with a short description.",
      "I'm most proud of LibreCloud/p0ntus mail, which is a cloud services provider that I self-host and maintain, free of charge.",
      "I frequently write and work on a website hosted on a public Linux server, known as a \"tilde\" You can check it out"
    ],
    "whereYouAre": [
      "My website is my home, not my business. I am not here to brag about my accomplishments or plug my cool SaaS product. That's why I've made every effort to make this website as personal and fun as possible.",
      "This page is currently hosted on Cloudflare Workers, after what happened with "
    ],
    "sections": {
      "whoIAm": "Who I am",
      "whatIDo": "What I do",
      "whereYouAre": "Where you are"
    },
    "contact": {
      "title": "Send me a message",
      "description": "Feel free to reach out for collaborations or just a hello :)",
      "button": "Contact Me"
    },
    "donation": {
      "title": "Support my work",
      "description": "Feeling generous? Support me or one of the causes I support!",
      "charities": {
        "title": "Charities",
        "description": "I support the following charities:",
        "unsilenced": "Unsilenced",
        "drugpolicy": "Drug Policy Alliance",
        "aclu": "ACLU"
      },
      "donate": {
        "title": "Donate to Me",
        "stripe": "Stripe",
        "github": "GitHub Sponsors"
      }
    },
    "profile": {
      "name": "Aidan",
      "description": "SysAdmin, Developer, and Student"
    },
    "miscWords": {
      "here": "here"
    }
  },
  "contact": {
    "title": "Contact",
    "sections": {
      "busyPerson": {
        "title": "I'm a busy person",
        "texts": [
          "I do a lot of things during the day and I'm not always able to respond to messages right away. Please be patient and remember not to demand things from me... Somehow this is an issue for people :(",
          "For the best chance of a response, please send me a message on Telegram. If you've made a pull request on one of my repos, I will most likely respond by the next day. If you've sent me an email, I will most likely respond within three days or less."
        ]
      },
      "callingNote": {
        "title": "A note about calling and texting",
        "texts": [
          "I have a phone number listed above. Please do not call or text me unless you absolutely need to. I will likely not respond, or use an automated recording system to handle your call. No, I haven't provided you my real phone number. I may be able to respond to your call/text, just know this is not checked/used often.",
          "If you need to get in touch with me, please send me a message on Telegram or an email."
        ]
      }
    },
    "buttons": {
      "github": "ihatenodejs",
      "telegram": "@p0ntu5",
      "bluesky": "@aidxn.cc",
      "phone": "(802) 416-9516",
      "email": "aidan@p0ntus.com"
    }
  }
} 