{
  "home": {
    "whoAmI": [
      "Hey there! My name is Aidan, and I'm a systems administrator, full-stack developer, and student from the Boston area. I primarily work with Linux, Docker, Next.js, Tailwind CSS and TypeScript.",
      "My favorite projects and hobbies revolve around web development and SysAdmin. Most of my work is released into the public domain.",
      "I'm also a huge advocate for AI and it's practical applications to programming and life itself. I am fond of open-source models the most, specifically Qwen3!",
      "When I'm not programming, I can be found re-flashing my phone with a new custom ROM and jumping between projects. I tend to be quite depressed, but I make do."
    ],
    "whatIDo": [
      "I'm at my best when I'm doing system administration and development in TypeScript. I frequently implement AI into my workflow.",
      "I manage three servers, including a mailserver (against my better judgement). I'm also crazy enough to self-host LLMs running on CPU.",
      "My biggest project is p0ntus, a cloud services provider which I self-host and maintain. It features most services you would find from large companies like Google, although everything is free and open-source."
    ],
    "whereYouAre": [
      "I am not here to brag about my accomplishments or plug my shitty SaaS. That's why I've made every effort to make this website as personal and fun as possible.",
      "I hope you find this website an interesting place to find more about me, but also learn something new; maybe inspire a new project or two.",
      "In a technical sense, this site is hosted on my dedicated server hosted in Buffalo, New York by ColoCrossing."
    ],
    "sections": {
      "whoIAm": "Who I am",
      "whatIDo": "What I do",
      "whereYouAre": "Where you are"
    },
    "contact": {
      "title": "Send me a message",
      "description": "Feel free to reach out for feedback, collaborations, or just a hello! I aim to answer all of my messages in a timely fashion, but please have patience.",
      "button": "Contact Me"
    },
    "donation": {
      "title": "Support my work",
      "description": "Feeling generous? Support me or one of the causes I support!",
      "charities": {
        "title": "Charities",
        "unsilenced": "Unsilenced",
        "drugpolicy": "Drug Policy Alliance",
        "aclu": "ACLU",
        "epic-restart": "EPIC Restart Foundation"
      },
      "donate": {
        "title": "Donate to Me",
        "stripe": "Stripe",
        "github": "GitHub Sponsors"
      }
    },
    "profile": {
      "name": "Aidan",
      "description": "SysAdmin, Developer, and Student"
    },
    "miscWords": {
      "here": "here"
    }
  },
  "contact": {
    "title": "Contact",
    "sections": {
      "busyPerson": {
        "title": "I'm a busy person",
        "texts": [
          "I'm busy most of the time, so please be patient and understanding of my workload. I can tend to be offline for a few days when I'm busy, but I will respond as soon as I can.",
          "For the best chance of a response, please send me a message on Telegram. If you've made a pull request on one of my repos, I will most likely respond by the next day. If you've sent me an email, I will most likely respond within three days or less."
        ]
      },
      "callingNote": {
        "title": "A note about calling and texting",
        "texts": [
          "I have a phone number listed above. Please do not call or text me unless you absolutely need to. I will likely not respond, or use an automated recording system to handle your call. No, I haven't provided you my actual phone number, it's a Voice over IP number. I may be able to respond to your call/text, just know this is not checked/used often.",
          "If you need to get in touch with me, please send me a message on Telegram or an email. I will provide my actual phone number if you have a valid reason."
        ]
      }
    }
  },
  "about": {
    "title": "Get to Know Me",
    "description": "Hey there! My name is Aidan, and I'm a systems administrator, full-stack developer, and student from the United States. I primarily work with Linux, Docker, Next.js, and Node.js.",
    "sections": {
      "projects": "Projects",
      "hobbies": "Hobbies",
      "devices": "Devices",
      "contributions": "Contributions",
      "featuredProjects": "Featured Projects"
    },
    "projects": [
      "I have worked on countless projects over the past five years, for the most part. I started learning to code with Python when I was seven and my interest has only evolved from there. I got into web development due to my uncle, who taught my how to write my first lines of HTML.",
      "Recently, I have been involved in developing several projects, especially with TypeScript, which is my new favorite language as of a year ago. My biggest project currently is p0ntus, a free service provider for privacy-focused individuals.",
      "You will also come to find that I have an addiction to Docker! Almost every project I've made is able to be run in Docker.",
      "Me and my developer friends operate an organization called ABOCN, where we primarily maintain a Telegram bot called Kowalski. You can find it on Telegram as @KowalskiNodeBot.",
      "I have learned system administration from the past three years of learning Linux for practical use and fun. I currently operate four servers running in the cloud, ran out of Canada, Germany, and the United States.",
      "I own a channel called PontusHub on Telegram, where I post updates about my projects, along with commentary and info about my projects related to the Android rooting community."
    ],
    "hobbies": [
      "When I'm not programming, I can typically be found distro hopping or flashing a new ROM to my phone. I also spend a lot of time spreading Next.js and TypeScript propaganda to JavaScript developers.",
      "I consider maintaining my devices as a hobby as well, as I devote a lot of time to it. I genuinely enjoy installing Arch, Gentoo, and NixOS frequently, and flashing new ROMs to the phones I own.",
      "I am frequently active on my Forgejo server and GitHub, and aim to make daily contributions. I am a big fan of open source software and public domain software (which most of my repos are licensed under). In fact, the website you're currently on is free and open source. It's even under the public domain!",
      "When I touch grass, I prefer to walk on the streets, especially in Boston, Massachusetts. I also used to swim competitively, though it has turned into to a casual hobby over time.",
      "Editing Wikipedia has also been a good pastime for me, and I have been editing for a year and a half now. As of writing, I have made 6.1k edits to the English Wikipedia. I am also an AfC reviewer, new page reviewer, and rollbacker. You can find me on Wikipedia as OnlyNano."
    ],
    "devices": {
      "Mobile Devices": [
        "I use a Google Pixel 9 Pro XL (komodo) as my daily driver. It runs Android 16 and is proudly rooted with KernelSU-Next.",
        "My previous phone, the Google Pixel 7 Pro (cheetah), is still in use as my secondary WiFi-only device. It runs Android 16 and is proudly rooted with KernelSU-Next.",
        "I also have a Google Pixel 3a XL (bonito) which I use as a tertiary device. It runs LineageOS 22.2 and is rooted with Magisk."
      ],
      "Laptops": [
        "I currently daily-drive with a 16-inch MacBook Pro with an M4 Max, 64GB of memory, 2TB of storage, 16 core CPU, and a 40 core GPU.",
        "I use a Lenovo Thinkpad T470s with macOS Sequoia (using OpenCore) as my \"side piece,\" if you will. I've had it for about a year now, and it's been a great experience.",
        "I also own two MacBook Airs (2015 and 2013 base models) and an HP Chromebook, used as secondary devices. The 2013 runs unsupported macOS Sequoia Beta, the 2015 runs Xubuntu, and the Chromebook runs Arch Linux."
      ]
    },
    "contributions": [
      "Most of my repositories have migrated to p0ntus git. My username is aidan. You can find me on GitHub as ihatenodejs."
    ],
    "featuredProjects": [
      "Here's just four of my top projects. Star and fork counts are manually updated and count both Gitea and GitHub."
    ]
  }
}